{"meta":{"title":"WANG Tianchen","subtitle":"","description":"","author":"John Doe","url":"http://example.com","root":"/"},"pages":[{"title":"about","date":"2022-02-19T03:07:28.000Z","updated":"2022-02-19T05:51:24.266Z","comments":false,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"PrefaceNow I’m finding internships of software developer engineer(SDE) in Japan or remote. If you would like to offer me some opportunities, please feel free to cantact me at anytimes. I’ll be writing interesting projects and articles in this blog. This blog was created by Hexo + GihubPages. About MeI’m a M1 student at Kyoto University, graduate school of informatics, Takayuki Ito LAB. I will graduate at Mar.2024. I’m a native speaker of Mandarin, and can work in the English or Japanese environments. I am familiar with Java, Python, C and MATLAB. I am also familiar with AWS. The Other Side of MeI had 30,000 fans in Zhihu (similiar to a Chinese verson Quora). I had written more than 1,000,000 words in different platforms with different themes. I was the captain of the school of Automation’s soccer team in college (Position: GK/DF). I had participated in more than 20 conferences of the Model United Nation and had chaired Model United Nation conferences such as the FAO. ContactIf you are interested in me, please feel free to contact me at any time. Mail Address: wang.tianchen333@gmail.com Tel: +81 080-9525-1185 The link of Github/Linkedin/Zhihu/Wechat is in the top of page."}],"posts":[{"title":"The Road to Kyoto University","slug":"The-Road-to-Kyoto-University","date":"2022-02-19T04:10:59.000Z","updated":"2022-02-20T13:18:48.498Z","comments":true,"path":"2022/02/19/The-Road-to-Kyoto-University/","link":"","permalink":"http://example.com/2022/02/19/The-Road-to-Kyoto-University/","excerpt":"","text":"This essay commemorates one of the most courageous times of my life.#京都大学大学院社会情报学修士夏入试经验分享 在人生最动荡不安的一段时间，我独身一人来到疫情下的东京，最终合格了第一志愿的京都大学。趁着热忱与记忆还未模糊，决定先将我的备考历程写下，希望能够给正在准备中的你提供微不足道的帮助。##0 はじめに如果要给京大社会情报学修士备考定下一个基调，那么应当是“情报战”。 作为外国人的我们，想要在京大学部生与日本外部生环绕下撕下一个合格名额，那在情报上就要努力与他们站在同一起跑线。我是有些database属性的人，我坚信收集的情报越多，上岸的可能性就越高。 为了收集“情报”，我基本反复看过十遍全网所有的社情经验贴（中文/日文）；潜入了一个上岸日本人组建的社情备考slack组，享受了他们分享的google drive材料；推特上找曾经上岸的日本人私聊；最终找到了适合我的备考路。（P.S.1 这一点可能仅适合于京大社情）（P.S.2 今年确实有我所知的因为情报收集不到位而落的朋友）(P.S.3 更多情报可以参考我的收藏夹中“日本留学”部分) 除此之外，与中文环境下的朋友交流是获得“情报”最快的方式。闭门造车不可取，你是清北佬当我没说。请牢记我们的敌人是日本考生，而不是与中国人自己恶意内卷。共同交流绝对优于隐瞒信息。在此留下情报学备考交流群群号：1149872174。 或许我这篇文章可以提供足够的“情报”给你，但我仍然希望你重走一遍我的这条路，至少应当看过所有已存在的经验贴吧。之后我会将链接放到文末。 我人生的信条是要么不做，要么全力以赴。恰好和数据库事务的Atomicity碰上了。所以： 本篇经验贴只适合给对日本修士备考有基础了解，有良好的信息收集能力和抗逆能力的同学。我宁可多在这里废话几句也不会给那些随便查一下就明白的基础知识提一个字，如果你向我提问的问题让我觉得你完全没有认真做信息收集的话，我不会回应的。但除此之外的问题我都会认真回答。 另，出售个人备考所写的过去问答案，同时可以提供京大社情辅导，有意者私聊。","categories":[],"tags":[{"name":"KyotoU","slug":"KyotoU","permalink":"http://example.com/tags/KyotoU/"}]}],"categories":[],"tags":[{"name":"KyotoU","slug":"KyotoU","permalink":"http://example.com/tags/KyotoU/"}]}