{"meta":{"title":"WANG Tianchen","subtitle":"","description":"","author":"John Doe","url":"http://example.com","root":"/"},"pages":[{"title":"about","date":"2022-02-19T03:07:28.000Z","updated":"2022-02-19T05:51:24.266Z","comments":false,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"PrefaceNow I’m finding internships of software developer engineer(SDE) in Japan or remote. If you would like to offer me some opportunities, please feel free to cantact me at anytimes. I’ll be writing interesting projects and articles in this blog. This blog was created by Hexo + GihubPages. About MeI’m a M1 student at Kyoto University, graduate school of informatics, Takayuki Ito LAB. I will graduate at Mar.2024. I’m a native speaker of Mandarin, and can work in the English or Japanese environments. I am familiar with Java, Python, C and MATLAB. I am also familiar with AWS. The Other Side of MeI had 30,000 fans in Zhihu (similiar to a Chinese verson Quora). I had written more than 1,000,000 words in different platforms with different themes. I was the captain of the school of Automation’s soccer team in college (Position: GK/DF). I had participated in more than 20 conferences of the Model United Nation and had chaired Model United Nation conferences such as the FAO. ContactIf you are interested in me, please feel free to contact me at any time. Mail Address: wang.tianchen333@gmail.com Tel: +81 080-9525-1185 The link of Github/Linkedin/Zhihu/Wechat is in the top of page."}],"posts":[{"title":"The Road to Kyoto University","slug":"The-Road-to-Kyoto-University","date":"2022-02-19T04:10:59.000Z","updated":"2022-02-19T04:28:09.556Z","comments":true,"path":"2022/02/19/The-Road-to-Kyoto-University/","link":"","permalink":"http://example.com/2022/02/19/The-Road-to-Kyoto-University/","excerpt":"","text":"This essay commemorates one of the most courageous times of my life.","categories":[],"tags":[{"name":"KyotoU","slug":"KyotoU","permalink":"http://example.com/tags/KyotoU/"}]}],"categories":[],"tags":[{"name":"KyotoU","slug":"KyotoU","permalink":"http://example.com/tags/KyotoU/"}]}